artillery/loading-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 5
      rampTo: 300
      name: Ramp up load
    - duration: 60
      arrivalRate: 300
      name: Sustained load
  # payload:
  #   path: "../../../ETL/questions.csv"
  #   fields:
  #     - "product_id"
scenarios:
  - name: "Initial Load"
    flow:
      - get:
          url: "/qa/1"